## Midterm Project

Rachel Cleal (rrc2faz)        
March 23, 2023

### Import the Necessary Libraries

In [1]:
import os
import numpy
import pandas as pd
from sqlalchemy import create_engine
import json
import pprint
import requests
import requests.exceptions
import datetime
import pymongo

### Declare & Assign Connection Variables for MySQL Server & Databases

In [2]:
host_name = "localhost"
host_ip = "127.0.0.1"
port = "3306"
user_id = "root"
pwd = "Passw0rd123"

src_dbname = "sakila"
dst_dbname = "sakila_dw2"

In [3]:
def get_dataframe(user_id, pwd, host_name, db_name, sql_query):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, connection);
    connection.close()
    
    return dframe


def set_dataframe(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

In [4]:
conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}"
sqlEngine = create_engine(conn_str, pool_recycle=3600)

sqlEngine.execute(f"DROP DATABASE IF EXISTS `{dst_dbname}`;")
sqlEngine.execute(f"CREATE DATABASE `{dst_dbname}`;")
sqlEngine.execute(f"USE {dst_dbname};")

# --------------------------------------------------------------------
## Extracting Data From MySQL

##### **EXTRACT** Data from the the Sakila SQL Database Tables
Imports: sakila.customers, sakila.inventory, sakila.rentals

In [5]:
sql_customers = "SELECT * FROM sakila.customer;"
df_customers = get_dataframe(user_id, pwd, host_name, src_dbname, sql_customers)
df_customers.head(5)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-14 23:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-14 23:57:20
2,3,1,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,7,1,2006-02-14 22:04:36,2006-02-14 23:57:20
3,4,2,BARBARA,JONES,BARBARA.JONES@sakilacustomer.org,8,1,2006-02-14 22:04:36,2006-02-14 23:57:20
4,5,1,ELIZABETH,BROWN,ELIZABETH.BROWN@sakilacustomer.org,9,1,2006-02-14 22:04:36,2006-02-14 23:57:20

In [6]:
sql_inventory = "SELECT * FROM sakila.inventory;"
df_inventory = get_dataframe(user_id, pwd, host_name, src_dbname, sql_inventory)
df_inventory.head(5)

   inventory_id  film_id  store_id         last_update
0             1        1         1 2006-02-15 00:09:17
1             2        1         1 2006-02-15 00:09:17
2             3        1         1 2006-02-15 00:09:17
3             4        1         1 2006-02-15 00:09:17
4             5        1         2 2006-02-15 00:09:17

In [7]:
sql_rentals = "SELECT * FROM sakila.rental;"
df_rentals = get_dataframe(user_id, pwd, host_name, src_dbname, sql_rentals)
#df_rentals.rename(columns={"rental_id":"customer_key"}, inplace=True)
df_rentals.head(5)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 16:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 16:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 16:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 16:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 16:30:53

##### Perform Necessary **TRANSFORMations** To Exclude Unnecessary Columns

In [8]:
drop_cols = ['email','address_id','active','store_id']
df_customers.drop(drop_cols, axis=1, inplace=True)
#df_customers.rename(columns={"customer_id":"customer_key"}, inplace=True)
df_customers.head(5)

   customer_id first_name last_name         create_date         last_update
0            1       MARY     SMITH 2006-02-14 22:04:36 2006-02-14 23:57:20
1            2   PATRICIA   JOHNSON 2006-02-14 22:04:36 2006-02-14 23:57:20
2            3      LINDA  WILLIAMS 2006-02-14 22:04:36 2006-02-14 23:57:20
3            4    BARBARA     JONES 2006-02-14 22:04:36 2006-02-14 23:57:20
4            5  ELIZABETH     BROWN 2006-02-14 22:04:36 2006-02-14 23:57:20

In [9]:
drop_cols = ['store_id']
df_inventory.drop(drop_cols, axis=1, inplace=True)
# df_inventory.rename(columns={"id":"inventory_key"}, inplace=True)

df_inventory.head(5)

   inventory_id  film_id         last_update
0             1        1 2006-02-15 00:09:17
1             2        1 2006-02-15 00:09:17
2             3        1 2006-02-15 00:09:17
3             4        1 2006-02-15 00:09:17
4             5        1 2006-02-15 00:09:17

In [10]:
drop_cols = ['staff_id']
df_rentals.drop(drop_cols, axis=1, inplace=True)
# df_rentals.rename(columns={"id":"rental_key"}, inplace=True)

df_rentals.head(5)

,rental_id,rental_date,inventory_id,customer_id,return_date,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,2006-02-15 16:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,2006-02-15 16:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,2006-02-15 16:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2006-02-15 16:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,2006-02-15 16:30:53

# --------------------------------------------------------------------
## Retrieving Data From A Local File (CSV)

##### **EXTRACT** Data from a local CSV file
Imports: sakila.payment

In [11]:
df_payment = pd.read_csv(r'C:\Users\ds2002-02-student\Downloads\DS-2002-002-main\DS-2002-002-main\Projects\sakila_payment.csv', header=0)
df_payment.head()

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76,2.99,2005-05-25 11:30:37,2006-02-15 17:12:30
1,2,1,1,573,0.99,2005-05-28 10:35:23,2006-02-15 17:12:30
2,3,1,1,1185,5.99,2005-06-15 00:54:12,2006-02-15 17:12:30
3,4,1,2,1422,0.99,2005-06-15 18:02:53,2006-02-15 17:12:30
4,5,1,2,1476,9.99,2005-06-15 21:08:46,2006-02-15 17:12:30

# ----------------------------------------------------------------
## Importing Data From MongoDB (JSON)
Imports: sakila.films

#### Declare & Assign Connection Variables for the MongoDB Server, the MySQL Server & Databases with which You'll be Working

In [12]:
mysql_uid = "root"
mysql_pwd = "Passw0rd123"

atlas_cluster_name = "sandbox.zibbf"
atlas_user_name = "m001-student"
atlas_password = "m001-mongodb-basics"

conn_str = {"local" : f"mongodb://localhost:27017/",
    "atlas" : f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.mongodb.net"
}

src_dbname = "sakila"
dst_dbname = "sakila_dw2"

print(f"Local Connection String: {conn_str['local']}")

Local Connection String: mongodb://localhost:27017/

#### Define Functions for Getting Data From and Setting Data Into Databases

In [13]:
def get_sql_dataframe(user_id, pwd, db_name, sql_query):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    conn = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, conn);
    conn.close()
    
    return dframe


def get_mongo_dataframe(connect_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(connect_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe

#### Populate MongoDB with Source Data
You only need to run this cell once; however, the operation is *idempotent*.  In other words, it can be run multiple times without changing the end result.

In [14]:
client = pymongo.MongoClient(conn_str["local"])
db = client[src_dbname]

# Gets the path of the Current Working Directory for this Notebook, and then Appends the 'data' directory.
data_dir = os.path.join(os.getcwd(), 'data')
# data_dir = os.path.join(r'C:\Users\ds2002-02-student\Downloads\DS-2002-002-main\DS-2002-002-main\Projects\')

json_files = {"df_films" : 'sakila_films.json'}

for file in json_files:
    db.drop_collection(file)
    json_file = os.path.join(data_dir, json_files[file])
    with open(json_file, 'r') as openfile:
        json_object = json.load(openfile)
        file = db[file]
        result = file.insert_many(json_object)
        print(f"{file} was successfully loaded.")

        
client.close()

Collection(Database(MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True), 'sakila'), 'df_films') was successfully loaded.

##### Create and Populate the New Dimension Tables
Extract Data from the Source MongoDB Collections Into DataFrames

In [15]:
query = {}
collection = "df_films"

df_films = get_mongo_dataframe(conn_str['local'], src_dbname, collection, query)
df_films.head(5)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 00:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 00:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,None,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 00:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,None,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 00:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,None,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 00:03:42

##### Perform Any Necessary **Transform**ations to the DataFrames

In [16]:
drop_cols = ['release_year','description','language_id','original_language_id','length','rating','special_features','replacement_cost']
df_films.drop(drop_cols, axis=1, inplace=True)

df_films.head(5)

,film_id,title,rental_duration,rental_rate,last_update
0,1,ACADEMY DINOSAUR,6,0.99,2006-02-15 00:03:42
1,2,ACE GOLDFINGER,3,4.99,2006-02-15 00:03:42
2,3,ADAPTATION HOLES,7,2.99,2006-02-15 00:03:42
3,4,AFFAIR PREJUDICE,5,2.99,2006-02-15 00:03:42
4,5,AFRICAN EGG,6,2.99,2006-02-15 00:03:42

# -------------------------------------------------------------------------
## Creating A Fact Table
Populating my fact table, Fact_Rentals, with data from df_customers, df_payment, df_inventory, df_rentals, and df_films

In [17]:
customer_payments = pd.merge(df_customers, df_payment, on='customer_id', how='inner') # Merge & Inner Join
customer_payments.head(5)

,customer_id,first_name,last_name,create_date,last_update_x,payment_id,staff_id,rental_id,amount,payment_date,last_update_y
0,1,MARY,SMITH,2006-02-14 22:04:36,2006-02-14 23:57:20,1,1,76,2.99,2005-05-25 11:30:37,2006-02-15 17:12:30
1,1,MARY,SMITH,2006-02-14 22:04:36,2006-02-14 23:57:20,2,1,573,0.99,2005-05-28 10:35:23,2006-02-15 17:12:30
2,1,MARY,SMITH,2006-02-14 22:04:36,2006-02-14 23:57:20,3,1,1185,5.99,2005-06-15 00:54:12,2006-02-15 17:12:30
3,1,MARY,SMITH,2006-02-14 22:04:36,2006-02-14 23:57:20,4,2,1422,0.99,2005-06-15 18:02:53,2006-02-15 17:12:30
4,1,MARY,SMITH,2006-02-14 22:04:36,2006-02-14 23:57:20,5,2,1476,9.99,2005-06-15 21:08:46,2006-02-15 17:12:30

In [18]:
# Merge df_inventory and df_films, name it ft_if
# ft_if = pd.merge(df_inventory, df_films, on='film_id', how='inner') # Merge & Inner Join
# ft_if.head(5)

In [19]:
# Merge ft_cs and df_rentals, name it ft_csr
customer_payments_rentals = pd.merge(customer_payments, df_rentals, on='customer_id', how='inner') # Merge & Inner Join
customer_payments_rentals.head(5)

,customer_id,first_name,last_name,create_date,last_update_x,payment_id,staff_id,rental_id_x,amount,payment_date,last_update_y,rental_id_y,rental_date,inventory_id,return_date,last_update
0,1,MARY,SMITH,2006-02-14 22:04:36,2006-02-14 23:57:20,1,1,76,2.99,2005-05-25 11:30:37,2006-02-15 17:12:30,76,2005-05-25 11:30:37,3021,2005-06-03 12:00:37,2006-02-15 16:30:53
1,1,MARY,SMITH,2006-02-14 22:04:36,2006-02-14 23:57:20,1,1,76,2.99,2005-05-25 11:30:37,2006-02-15 17:12:30,573,2005-05-28 10:35:23,4020,2005-06-03 06:32:23,2006-02-15 16:30:53
2,1,MARY,SMITH,2006-02-14 22:04:36,2006-02-14 23:57:20,1,1,76,2.99,2005-05-25 11:30:37,2006-02-15 17:12:30,1185,2005-06-15 00:54:12,2785,2005-06-23 02:42:12,2006-02-15 16:30:53
3,1,MARY,SMITH,2006-02-14 22:04:36,2006-02-14 23:57:20,1,1,76,2.99,2005-05-25 11:30:37,2006-02-15 17:12:30,1422,2005-06-15 18:02:53,1021,2005-06-19 15:54:53,2006-02-15 16:30:53
4,1,MARY,SMITH,2006-02-14 22:04:36,2006-02-14 23:57:20,1,1,76,2.99,2005-05-25 11:30:37,2006-02-15 17:12:30,1476,2005-06-15 21:08:46,1407,2005-06-25 02:26:46,2006-02-15 16:30:53

In [20]:
cpri = pd.merge(customer_payments_rentals, df_inventory, on='inventory_id', how='inner') # Merge & Inner Join
drop_cols = ['inventory_id','last_update_x','last_update_y','staff_id','rental_id_y'] # Drop the columns that are duplicates and causing error
cpri.drop(drop_cols, axis=1, inplace=True)
cpri.head(5)

C:\Users\ds2002-02-student\AppData\Local\Temp\2\ipykernel_1660\3376876594.py:1: FutureWarning: Passing 'suffixes' which cause duplicate columns {'last_update_x'} in the result is deprecated and will raise a MergeError in a future version.
  cpri = pd.merge(customer_payments_rentals, df_inventory, on='inventory_id', how='inner') # Merge & Inner Join

,customer_id,first_name,last_name,create_date,payment_id,rental_id_x,amount,payment_date,rental_date,return_date,film_id
0,1,MARY,SMITH,2006-02-14 22:04:36,1,76,2.99,2005-05-25 11:30:37,2005-05-25 11:30:37,2005-06-03 12:00:37,663
1,1,MARY,SMITH,2006-02-14 22:04:36,2,573,0.99,2005-05-28 10:35:23,2005-05-25 11:30:37,2005-06-03 12:00:37,663
2,1,MARY,SMITH,2006-02-14 22:04:36,3,1185,5.99,2005-06-15 00:54:12,2005-05-25 11:30:37,2005-06-03 12:00:37,663
3,1,MARY,SMITH,2006-02-14 22:04:36,4,1422,0.99,2005-06-15 18:02:53,2005-05-25 11:30:37,2005-06-03 12:00:37,663
4,1,MARY,SMITH,2006-02-14 22:04:36,5,1476,9.99,2005-06-15 21:08:46,2005-05-25 11:30:37,2005-06-03 12:00:37,663

In [21]:
fact_rentals = pd.merge(cpri, df_films, on='film_id', how='inner') # Merge & Inner Join
fact_rentals.head(5)

,customer_id,first_name,last_name,create_date,payment_id,rental_id_x,amount,payment_date,rental_date,return_date,film_id,title,rental_duration,rental_rate,last_update
0,1,MARY,SMITH,2006-02-14 22:04:36,1,76,2.99,2005-05-25 11:30:37,2005-05-25 11:30:37,2005-06-03 12:00:37,663,PATIENT SISTER,7,0.99,2006-02-15 00:03:42
1,1,MARY,SMITH,2006-02-14 22:04:36,2,573,0.99,2005-05-28 10:35:23,2005-05-25 11:30:37,2005-06-03 12:00:37,663,PATIENT SISTER,7,0.99,2006-02-15 00:03:42
2,1,MARY,SMITH,2006-02-14 22:04:36,3,1185,5.99,2005-06-15 00:54:12,2005-05-25 11:30:37,2005-06-03 12:00:37,663,PATIENT SISTER,7,0.99,2006-02-15 00:03:42
3,1,MARY,SMITH,2006-02-14 22:04:36,4,1422,0.99,2005-06-15 18:02:53,2005-05-25 11:30:37,2005-06-03 12:00:37,663,PATIENT SISTER,7,0.99,2006-02-15 00:03:42
4,1,MARY,SMITH,2006-02-14 22:04:36,5,1476,9.99,2005-06-15 21:08:46,2005-05-25 11:30:37,2005-06-03 12:00:37,663,PATIENT SISTER,7,0.99,2006-02-15 00:03:42

# -------------------------------------------------------------------------
## Loading Data With Dimension Tables
Populating my data warehouse with data from df_customers, df_inventory, df_payment, df_rentals, and df_films

In [22]:
dim_customers = df_customers
dim_customers.head(5)

   customer_id first_name last_name         create_date         last_update
0            1       MARY     SMITH 2006-02-14 22:04:36 2006-02-14 23:57:20
1            2   PATRICIA   JOHNSON 2006-02-14 22:04:36 2006-02-14 23:57:20
2            3      LINDA  WILLIAMS 2006-02-14 22:04:36 2006-02-14 23:57:20
3            4    BARBARA     JONES 2006-02-14 22:04:36 2006-02-14 23:57:20
4            5  ELIZABETH     BROWN 2006-02-14 22:04:36 2006-02-14 23:57:20

In [23]:
dim_inventory = df_inventory
dim_inventory.head(5)

   inventory_id  film_id         last_update
0             1        1 2006-02-15 00:09:17
1             2        1 2006-02-15 00:09:17
2             3        1 2006-02-15 00:09:17
3             4        1 2006-02-15 00:09:17
4             5        1 2006-02-15 00:09:17

In [24]:
dim_payment = df_payment
dim_payment.head(5)

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76,2.99,2005-05-25 11:30:37,2006-02-15 17:12:30
1,2,1,1,573,0.99,2005-05-28 10:35:23,2006-02-15 17:12:30
2,3,1,1,1185,5.99,2005-06-15 00:54:12,2006-02-15 17:12:30
3,4,1,2,1422,0.99,2005-06-15 18:02:53,2006-02-15 17:12:30
4,5,1,2,1476,9.99,2005-06-15 21:08:46,2006-02-15 17:12:30

In [25]:
dim_rentals = df_rentals
dim_rentals.head(5)

,rental_id,rental_date,inventory_id,customer_id,return_date,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,2006-02-15 16:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,2006-02-15 16:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,2006-02-15 16:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2006-02-15 16:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,2006-02-15 16:30:53

In [26]:
dim_films = df_films
dim_films.head(5)

,film_id,title,rental_duration,rental_rate,last_update
0,1,ACADEMY DINOSAUR,6,0.99,2006-02-15 00:03:42
1,2,ACE GOLDFINGER,3,4.99,2006-02-15 00:03:42
2,3,ADAPTATION HOLES,7,2.99,2006-02-15 00:03:42
3,4,AFFAIR PREJUDICE,5,2.99,2006-02-15 00:03:42
4,5,AFRICAN EGG,6,2.99,2006-02-15 00:03:42

In [33]:
dim_customers.rename(columns={"customer_id":"customer_key"}, inplace=True)
dim_inventory.rename(columns={"inventory_id":"inventory_key"}, inplace=True)
dim_payment.rename(columns={"payment_id":"payment_key"}, inplace=True)
dim_rentals.rename(columns={"rental_id":"rental_key"}, inplace=True)
dim_films.rename(columns={"film_id":"film_key"}, inplace=True)

In [34]:
db_operation = "insert"

# tables = [('dim_customers', df_customers, 'customer_key'),
#            ('dim_inventory', df_inventory, 'inventory_key'),
#            ('dim_payment', df_payment, 'payment_key'),
#            ('dim_rentals', df_rentals, 'rental_key'),
#            ('dim_films', df_films, 'film_key')]

tables = [('customers', dim_customers, 'customer_key'),
           ('inventory', dim_inventory, 'inventory_key'),
           ('payment', dim_payment, 'payment_key'),
           ('rentals', dim_rentals, 'rental_key'),
           ('films', dim_films, 'film_key')]

In [35]:
for table_name, dataframe, primary_key in tables:
    set_dataframe(user_id, pwd, host_name, dst_dbname, dataframe, table_name, primary_key, db_operation)

##### Tests to prove functionality

In [36]:
sql_test1 = "SELECT * FROM sakila_dw2.customers;"
sql_customers = get_dataframe(user_id, pwd, host_name, src_dbname, sql_test1)
sql_customers.head(5)

   customer_key first_name last_name         create_date         last_update
0             1       MARY     SMITH 2006-02-14 22:04:36 2006-02-14 23:57:20
1             2   PATRICIA   JOHNSON 2006-02-14 22:04:36 2006-02-14 23:57:20
2             3      LINDA  WILLIAMS 2006-02-14 22:04:36 2006-02-14 23:57:20
3             4    BARBARA     JONES 2006-02-14 22:04:36 2006-02-14 23:57:20
4             5  ELIZABETH     BROWN 2006-02-14 22:04:36 2006-02-14 23:57:20

In [37]:
sql_test2 = "SELECT * FROM sakila_dw2.rentals;"
sql_rentals = get_dataframe(user_id, pwd, host_name, src_dbname, sql_test2)
sql_rentals.head(5)

,rental_key,rental_date,inventory_id,customer_id,return_date,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,2006-02-15 16:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,2006-02-15 16:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,2006-02-15 16:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2006-02-15 16:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,2006-02-15 16:30:53

In [38]:
sql_test3 = "SELECT * FROM sakila_dw2.payment;"
sql_payment = get_dataframe(user_id, pwd, host_name, src_dbname, sql_test3)
sql_payment.head(5)

,payment_key,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76,2.99,2005-05-25 11:30:37,2006-02-15 17:12:30
1,2,1,1,573,0.99,2005-05-28 10:35:23,2006-02-15 17:12:30
2,3,1,1,1185,5.99,2005-06-15 00:54:12,2006-02-15 17:12:30
3,4,1,2,1422,0.99,2005-06-15 18:02:53,2006-02-15 17:12:30
4,5,1,2,1476,9.99,2005-06-15 21:08:46,2006-02-15 17:12:30

# --------------------------------------------------------------------
## Creating A Date Dimension

### Design a dimensional data mart

 My Dimensional data mart will use the Sakila database and include 5 dimension tables: Rental, Customers, Inventory, Stores, and Films. 
 The goal of this is to show the history of film DVD rentals to customers over time.

##### Get the Data from the Date Dimension Table.

In [41]:
sql_dim_date = "SELECT date_key, full_date FROM sakila_dw2.dim_date;"
df_dim_date = get_dataframe(user_id, pwd, host_name, src_dbname, sql_dim_date)
df_dim_date.full_date = df_dim_date.full_date.astype('datetime64')
df_dim_date.head(2)

   date_key  full_date
0  20050501 2005-05-01
1  20050502 2005-05-02

In [42]:
fact_rentals['create_date'] = pd.to_datetime(fact_rentals['create_date']).dt.date
fact_rentals['payment_date'] = pd.to_datetime(fact_rentals['payment_date']).dt.date
fact_rentals['rental_date'] = pd.to_datetime(fact_rentals['rental_date']).dt.date
fact_rentals['return_date'] = pd.to_datetime(fact_rentals['return_date']).dt.date
fact_rentals['last_update'] = pd.to_datetime(fact_rentals['last_update']).dt.date

fact_rentals.head(5)

,customer_id,first_name,last_name,create_date,payment_id,rental_id_x,amount,payment_date,rental_date,return_date,film_id,title,rental_duration,rental_rate,last_update
0,1,MARY,SMITH,2006-02-14,1,76,2.99,2005-05-25,2005-05-25,2005-06-03,663,PATIENT SISTER,7,0.99,2006-02-15
1,1,MARY,SMITH,2006-02-14,2,573,0.99,2005-05-28,2005-05-25,2005-06-03,663,PATIENT SISTER,7,0.99,2006-02-15
2,1,MARY,SMITH,2006-02-14,3,1185,5.99,2005-06-15,2005-05-25,2005-06-03,663,PATIENT SISTER,7,0.99,2006-02-15
3,1,MARY,SMITH,2006-02-14,4,1422,0.99,2005-06-15,2005-05-25,2005-06-03,663,PATIENT SISTER,7,0.99,2006-02-15
4,1,MARY,SMITH,2006-02-14,5,1476,9.99,2005-06-15,2005-05-25,2005-06-03,663,PATIENT SISTER,7,0.99,2006-02-15

Convert each column into datetime64

In [43]:
fact_rentals.create_date = fact_rentals.create_date.astype('datetime64[D]').astype('datetime64')
fact_rentals.payment_date = fact_rentals.payment_date.astype('datetime64[D]').astype('datetime64')
fact_rentals.rental_date = fact_rentals.rental_date.astype('datetime64[D]').astype('datetime64')
fact_rentals.return_date = fact_rentals.return_date.astype('datetime64[D]').astype('datetime64')
fact_rentals.last_update = fact_rentals.last_update.astype('datetime64[D]').astype('datetime64')

fact_rentals.head(5)

,customer_id,first_name,last_name,create_date,payment_id,rental_id_x,amount,payment_date,rental_date,return_date,film_id,title,rental_duration,rental_rate,last_update
0,1,MARY,SMITH,2006-02-14,1,76,2.99,2005-05-25,2005-05-25,2005-06-03,663,PATIENT SISTER,7,0.99,2006-02-15
1,1,MARY,SMITH,2006-02-14,2,573,0.99,2005-05-28,2005-05-25,2005-06-03,663,PATIENT SISTER,7,0.99,2006-02-15
2,1,MARY,SMITH,2006-02-14,3,1185,5.99,2005-06-15,2005-05-25,2005-06-03,663,PATIENT SISTER,7,0.99,2006-02-15
3,1,MARY,SMITH,2006-02-14,4,1422,0.99,2005-06-15,2005-05-25,2005-06-03,663,PATIENT SISTER,7,0.99,2006-02-15
4,1,MARY,SMITH,2006-02-14,5,1476,9.99,2005-06-15,2005-05-25,2005-06-03,663,PATIENT SISTER,7,0.99,2006-02-15

In [44]:
# Lookup the Surrogate Primary Key (date_key) that Corresponds to the "create_date" Column.
fact_rentals.create_date.astype('datetime64[ns]')

df_dim_create_date = df_dim_date.rename(columns={"date_key" : "create_date_key", "full_date" : "create_date"})
fact_rentals = pd.merge(fact_rentals, df_dim_create_date, on='create_date', how='left')
fact_rentals.drop(['create_date'], axis=1, inplace=True)
fact_rentals.head(2)

,customer_id,first_name,last_name,payment_id,rental_id_x,amount,payment_date,rental_date,return_date,film_id,title,rental_duration,rental_rate,last_update,create_date_key
0,1,MARY,SMITH,1,76,2.99,2005-05-25,2005-05-25,2005-06-03,663,PATIENT SISTER,7,0.99,2006-02-15,20060214
1,1,MARY,SMITH,2,573,0.99,2005-05-28,2005-05-25,2005-06-03,663,PATIENT SISTER,7,0.99,2006-02-15,20060214

In [45]:
# Lookup the Surrogate Primary Key (date_key) that Corresponds to the "payment_date" Column.
df_dim_payment_date = df_dim_date.rename(columns={"date_key" : "payment_date_key", "full_date" : "payment_date"})
fact_rentals = pd.merge(fact_rentals, df_dim_payment_date, on='payment_date', how='inner')
fact_rentals.drop(['payment_date'], axis=1, inplace=True)
fact_rentals.head(2)

,customer_id,first_name,last_name,payment_id,rental_id_x,amount,rental_date,return_date,film_id,title,rental_duration,rental_rate,last_update,create_date_key,payment_date_key
0,1,MARY,SMITH,1,76,2.99,2005-05-25,2005-06-03,663,PATIENT SISTER,7,0.99,2006-02-15,20060214,20050525
1,1,MARY,SMITH,1,76,2.99,2005-08-19,2005-08-20,663,PATIENT SISTER,7,0.99,2006-02-15,20060214,20050525

In [46]:
# Lookup the Surrogate Primary Key (date_key) that Corresponds to the "rental_date" Column.
df_dim_rental_date = df_dim_date.rename(columns={"date_key" : "rental_date_key", "full_date" : "rental_date"})
fact_rentals = pd.merge(fact_rentals, df_dim_rental_date, on='rental_date', how='inner')
fact_rentals.drop(['rental_date'], axis=1, inplace=True)
fact_rentals.head(2)

,customer_id,first_name,last_name,payment_id,rental_id_x,amount,return_date,film_id,title,rental_duration,rental_rate,last_update,create_date_key,payment_date_key,rental_date_key
0,1,MARY,SMITH,1,76,2.99,2005-06-03,663,PATIENT SISTER,7,0.99,2006-02-15,20060214,20050525,20050525
1,6,JENNIFER,DAVIS,146,57,4.99,2005-05-29,858,SUBMARINE BED,5,4.99,2006-02-15,20060214,20050525,20050525

In [47]:
# Lookup the Surrogate Primary Key (date_key) that Corresponds to the "return_date" Column.
df_dim_return_date = df_dim_date.rename(columns={"date_key" : "return_date_key", "full_date" : "return_date"})
fact_rentals = pd.merge(fact_rentals, df_dim_return_date, on='return_date', how='inner')
fact_rentals.drop(['return_date'], axis=1, inplace=True)
fact_rentals.head(2)

,customer_id,first_name,last_name,payment_id,rental_id_x,amount,film_id,title,rental_duration,rental_rate,last_update,create_date_key,payment_date_key,rental_date_key,return_date_key
0,1,MARY,SMITH,1,76,2.99,663,PATIENT SISTER,7,0.99,2006-02-15,20060214,20050525,20050525,20050603
1,19,RUTH,MARTINEZ,490,18,0.99,893,TITANS JERK,4,4.99,2006-02-15,20060214,20050525,20050525,20050603

In [48]:
# Lookup the Surrogate Primary Key (date_key) that Corresponds to the "last_update" Column.
df_dim_last_update = df_dim_date.rename(columns={"date_key" : "last_update_key", "full_date" : "last_update"})
fact_rentals = pd.merge(fact_rentals, df_dim_last_update, on='last_update', how='inner')
fact_rentals.drop(['last_update'], axis=1, inplace=True)
fact_rentals.head(2)

,customer_id,first_name,last_name,payment_id,rental_id_x,amount,film_id,title,rental_duration,rental_rate,create_date_key,payment_date_key,rental_date_key,return_date_key,last_update_key
0,1,MARY,SMITH,1,76,2.99,663,PATIENT SISTER,7,0.99,20060214,20050525,20050525,20050603,20060215
1,19,RUTH,MARTINEZ,490,18,0.99,893,TITANS JERK,4,4.99,20060214,20050525,20050525,20050603,20060215

##### Perform any necessary transformations

In [50]:
# Reorder the columns
ordered_columns = ['customer_id','first_name','last_name','film_id','title',
                   'rental_id_x','rental_duration','rental_rate','payment_id','amount','create_date_key',
                   'rental_date_key','return_date_key','payment_date_key','last_update_key']
fact_rentals = fact_rentals[ordered_columns]

In [51]:
fact_rentals.head(2)

,customer_id,first_name,last_name,film_id,title,rental_id_x,rental_duration,rental_rate,payment_id,amount,create_date_key,rental_date_key,return_date_key,payment_date_key,last_update_key
0,1,MARY,SMITH,663,PATIENT SISTER,76,7,0.99,1,2.99,20060214,20050525,20050603,20050525,20060215
1,19,RUTH,MARTINEZ,893,TITANS JERK,18,4,4.99,490,0.99,20060214,20050525,20050603,20050525,20060215

In [53]:
# Insert a new column, with an ever-incrementing numeric value, to serve as the primary key.
fact_rentals.insert(0, "fact_rentals_key", range(1, fact_rentals.shape[0]+1))
fact_rentals.head(5)

,fact_rentals_key,customer_id,first_name,last_name,film_id,title,rental_id_x,rental_duration,rental_rate,payment_id,amount,create_date_key,rental_date_key,return_date_key,payment_date_key,last_update_key
0,1,1,MARY,SMITH,663,PATIENT SISTER,76,7,0.99,1,2.99,20060214,20050525,20050603,20050525,20060215
1,2,19,RUTH,MARTINEZ,893,TITANS JERK,18,4,4.99,490,0.99,20060214,20050525,20050603,20050525,20060215
2,3,19,RUTH,MARTINEZ,893,TITANS JERK,110,4,4.99,491,9.99,20060214,20050525,20050603,20050525,20060215
3,4,1,MARY,SMITH,663,PATIENT SISTER,573,7,0.99,2,0.99,20060214,20050525,20050603,20050528,20060215
4,5,19,RUTH,MARTINEZ,893,TITANS JERK,591,4,4.99,494,2.99,20060214,20050525,20050603,20050528,20060215

##### Write back to SQL

In [55]:
table_name = "fact_rentals"
primary_key = "fact_rentals_key"
db_operation = "insert"

set_dataframe(user_id, pwd, host_name, dst_dbname, fact_rentals, table_name, primary_key, db_operation)

# --------------------------------------------------------------------
## SQL Statements To Demonstrate Proper Functionality
SQL SELECT statement that returns:
-	Each Customers Last Name
-	The total amount of payment associated with each customer

In [65]:
my_test = """
    SELECT customers.`last_name` AS `customer_name`,
        SUM(payment.`amount`) AS `total_amount_paid`
    FROM `{0}`.`payment` AS payment
    INNER JOIN `{0}`.`customers` AS customers
    ON payment.customer_id = customers.customer_key
    GROUP BY customers.`last_name`;
""".format(dst_dbname)

my_test1 = get_dataframe(user_id, pwd, host_name, src_dbname, my_test)
my_test1.head(5)

  customer_name  total_amount_paid
0         SMITH             118.68
1       JOHNSON             128.73
2      WILLIAMS             135.74
3         JONES              81.78
4         BROWN             144.62

------------------------------------------------
SQL SELECT statement that returns:
-	Each film title
-	The average rental rate for each film

In [62]:
my_test = """
    SELECT films.`title`,
        AVG(fact_rentals.`rental_rate`) AS `avg_rental_rate`
    FROM `{0}`.`fact_rentals`
    INNER JOIN `{0}`.`films`
    ON films.film_key = fact_rentals.film_id
    GROUP BY films.`title`;
""".format(dst_dbname)

my_test1 = get_dataframe(user_id, pwd, host_name, src_dbname, my_test)
my_test1.head(5)

               title  avg_rental_rate
0     PATIENT SISTER             0.99
1        TITANS JERK             4.99
2  TALENTED HOMICIDE             0.99
3        DIARY PANIC             2.99
4        MILLION ACE             4.99

The End :-)